alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"\n"That depends a good deal on where you want to get to", said the Cat.\n"I don\'t much care where" —— said Alice.\n"Then it doesn\'t matter which way you go", said the Cat.\n"—— so long as I get somewhere" -- Alice added as an explanation.\n"Oh, you\'re sure to do that", said the Cat, "if you only walk long enough."')
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк
print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
Sblack_sea = 436402
Sazov_sea = 37800
print(Sblack_sea + Sazov_sea,' км2')
# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
total_sklad_1_2 = 250449
total_sklad_2_3 = 222950
all = 375291
sklad_1 = all - total_sklad_2_3
sklad_3 = all - total_sklad_1_2
sklad_2 = all - sklad_1 - sklad_3
print('Склад 1 тотал = ', sklad_1)
print('Склад 2 тотал = ', sklad_2)
print('Склад 3 тотал = ', sklad_3)

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
monthly_cost = 1179
month = 18
print("Стоимость комп'ютера, will be",monthly_cost*month)
# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9
print(a,b,c,d,e,f)
# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
piza_velika = 274
piza_sredyaya = 218
sik = 35
tort = 350
voda = 21
total_cena = piza_velika * 4 + piza_sredyaya * 2 + sik*4 + tort*1 + voda*3
print(total_cena)
# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
total_foto = 232
storinka = 8
if total_foto % storinka == 0:
    print(total_foto // storinka)
else:
    print(total_foto // storinka + 1)
# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
distance = 1600
rashod = 9
stop_after_oil = 48
need_oil = distance // 100 * rashod
stop_count = need_oil // stop_after_oil
print('Понадобиться примерно', need_oil, 'литров бензина')
print('Придеться остановиться', stop_count, 'раз(а)')